Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СессииВебКабинетаСУ/СессииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СессииВебКабинетаСУ</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗависимостиДанныхВебКабинетаСУ/ЗависимостиДанныхВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗависимостиДанныхВебКабинетаСУ</name>
  <dimensions>
    <name>Зависимость</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗаданияНаОбновлениеДанныхВебКабинетаСУ/ЗаданияНаОбновлениеДанныхВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаОбновлениеДанныхВебКабинетаСУ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПроцедуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТемыВебКабинетаСУ/ТемыВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТемыВебКабинетаСУ</name>
  <enumValues>
    <name>Облако</name>
  </enumValues>
  <enumValues>
    <name>Пляж</name>
  </enumValues>
  <enumValues>
    <name>Аквамарин</name>
  </enumValues>
  <enumValues>
    <name>Лето</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonModules/ВебКабинетСУ/Module.bsl
//////////////////////////////////////////////////////
// Общее

Функция Используется() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьВебКабинетСУ.Получить();	
КонецФункции

Функция ВерсияAPI() Экспорт
	Возврат ПолучитьОбщийМакет("ВерсияAPIВебКабинетаСУ").ПолучитьТекст();	
КонецФункции

Функция Редакция() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеНастройки = Константы.РедакцияВебКабинетаСУ.Получить();
	Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		ЗначениеНастройки = Перечисления.РедакцииВебКабинетаСУ.Редакция20;
	КонецЕсли;
	Возврат ЗначениеНастройки;
КонецФункции

Функция РедакцияСтрока() Экспорт
	
	НомерРедакции = Редакция();
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Возврат "2.0";
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		Возврат "3.0";
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Неизвестная редакция веб-кабинета'");
	
КонецФункции

Функция НомерПакета() Экспорт
	
	НомерПакета = ВерсияAPI();
	НомерПакета	= СтрЗаменить(НомерПакета, ".", "");
	НомерПакета = СокрЛП(НомерПакета);
	
	Возврат НомерПакета;
	
КонецФункции

Функция Модификация() Экспорт
	Возврат "cu"; //--# ЗАМЕНИТЬ НА "cc"	
КонецФункции

Функция ПутьККаталогуКартинок(Знач Путь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Путь) Тогда
		ВызватьИсключение НСтр("ru = 'Путь к каталогу веб-кабинета не задан'");	
	КонецЕСли;	
	
	ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Путь);
	
	Если ИспользуетсяАвтоматическаяНастройка() Тогда
		ЕдинственнаяПубликация = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге();
		ОтносительныйПуть = "cabinet\"; // По умолчанию
		Если ЗначениеЗаполнено(ЕдинственнаяПубликация) Тогда
			ДанныеПубликации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЕдинственнаяПубликация, "АдресКаталогаКартинок, АдресПубликации, Редакция");
			Если ДанныеПубликации.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30
				И ЗначениеЗаполнено(ДанныеПубликации.АдресКаталогаКартинок) Тогда
				ОтносительныйПуть = СтрЗаменить(ДанныеПубликации.АдресКаталогаКартинок, ДанныеПубликации.АдресПубликации + "/", ""); 
			КонецЕсли;
		КонецЕсли;		
		ПутьКаталогуКабинета = ПутьКаталогуКабинета + ОтносительныйПуть;
	Иначе
		ПутьКаталогуКабинета = ПутьКаталогуКабинета + "v8cabinet\" 
			+ СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы() + "\" + НомерПакета();
	КонецЕсли;
	
	ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(ПутьКаталогуКабинета);	
	ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКаталогуКабинета);
	
	Возврат ПутьКаталогуКабинета;
	
КонецФункции

Функция ПутьККаталогуУстановки(Знач Путь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Путь) Тогда
		ВызватьИсключение НСтр("ru = 'Путь к каталогу веб-кабинета не задан'");	
	КонецЕСли;
	
	Если Редакция() = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда		
		
		Возврат ПутьККаталогуКартинок(Путь); // Картинки размещаются вместе с файлами кабинета
		
	Иначе
		
		ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Путь);
		ПутьКаталогуКабинета = ПутьКаталогуКабинета + "wc";		
		ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ПривестиСлэши(ПутьКаталогуКабинета);	
		ПутьКаталогуКабинета = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКаталогуКабинета);
		
		Возврат ПутьКаталогуКабинета;
		
	КонецЕсли;
	
КонецФункции

Функция ИмяФайлаНастроек(Редакция = Неопределено) Экспорт
	
	Если Редакция = Неопределено Тогда
		НомерРедакции = Редакция();
	Иначе
		НомерРедакции = Редакция;
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Возврат "v8-settings.js";
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		Возврат "sdo-settings.js";
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Неизвестная редакция веб-кабинета'");
	
КонецФункции

Функция Перевод(Слово, Тип, ЯзыкСлова = "EN", ЯзыкПеревода = "RU") Экспорт
	
	//////////////////////////////////////////////
	// Создаем словарь
	
	Словарь = Новый ТаблицаЗначений;
	Словарь.Колонки.Добавить("EN");
	Словарь.Колонки.Добавить("RU");
	Словарь.Колонки.Добавить("UA");
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	
	// ОтборыДанныхВебКабинетаСУО_О
	
	Если Тип = "ОтборыДанныхВебКабинетаСУО" Тогда
	
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Active";
		НоваяСтрока.RU = "Активные";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Open";
		НоваяСтрока.RU = "Открытые";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Incoming";
		НоваяСтрока.RU = "Входящие";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Sent";
		НоваяСтрока.RU = "Исходящие";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Trash";
		НоваяСтрока.RU = "Удаленные";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Starred";
		НоваяСтрока.RU = "Помеченные";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Finished";
		НоваяСтрока.RU = "Завершенные";
		
		
	КонецЕсли;
		
	// ТипыДанныхВебКабинетаСУО
	
	Если Тип = "ТипыДанныхВебКабинетаСУО" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "EduActivity";
		НоваяСтрока.RU = "УчебнаяАктивность";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "EduActivityDescription";
		НоваяСтрока.RU = "УчебнаяАктивностьОписание";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "ForumCategory";
		НоваяСтрока.RU = "РазделФорума";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "MessageTopic";
		НоваяСтрока.RU = "ТемаСообщения";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Message";
		НоваяСтрока.RU = "Сообщение";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "DateView";
		НоваяСтрока.RU = "ДатаПросмотра";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Deleted";
		НоваяСтрока.RU = "Удалено";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Marked";
		НоваяСтрока.RU = "Помечено";		
		
		
	КонецЕсли;

	// КатегорииДанныхВебКабинетаСУО
	
	Если Тип = "КатегорииДанныхВебКабинетаСУО" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "UserPeriodical";
		НоваяСтрока.RU = "ПП";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "UserNonPeriodical";
		НоваяСтрока.RU = "ПН";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "CommonPeriodical";
		НоваяСтрока.RU = "ОП";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "CommonNonPeriodical";
		НоваяСтрока.RU = "ОН";
	
	КонецЕсли;
	
	// Метаданные
	
	Если Тип = "Метаданные" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Document.userActivity";
		НоваяСтрока.RU = "Документ.ПрохождениеОбученияСУО";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Document.userTask";
		НоваяСтрока.RU = "Документ.ПопыткаВыполненияЗаданияСУО";		
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Document.message";
		НоваяСтрока.RU = "Документ.СообщениеСУО";		
		
	КонецЕсли;
	
		
	//----------------------------------//	
	
	// Файлы
	
	Если Тип = "Файлы" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "name";
		НоваяСтрока.RU = "Имя";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "size";
		НоваяСтрока.RU = "Размер";	
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "dateModified";
		НоваяСтрока.RU = "ДатаИзменения";
	
	КонецЕсли;
	
	Если Тип = "РазделыВебКабинета" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Testing";
		НоваяСтрока.RU = "Тестирование";
		НоваяСтрока.UA = "Тестування";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Learning";
		НоваяСтрока.RU = "Обучение";
		НоваяСтрока.UA = "Навчання";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Library";
		НоваяСтрока.RU = "Библиотека";
		НоваяСтрока.UA = "Бібліотека";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "News";		
		НоваяСтрока.RU = "Новости";
		НоваяСтрока.UA = "Новини";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Forum";
		НоваяСтрока.RU = "Форум";
		НоваяСтрока.UA = "Форум";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Messages";
		НоваяСтрока.RU = "Сообщения";
		НоваяСтрока.UA = "Повідомлення";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Contacts";
		НоваяСтрока.RU = "Контакты";
		НоваяСтрока.UA = "Контакти";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Online resources";
		НоваяСтрока.RU = "Электронные ресурсы";
		НоваяСтрока.UA = "Електронні ресурси";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Settings";
		НоваяСтрока.RU = "Настройки";
		НоваяСтрока.UA = "Налаштування";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Exit";
		НоваяСтрока.RU = "Выход";
		НоваяСтрока.UA = "Вихід";
	
	КонецЕсли;	
	
	Если Тип = "ПоляРегистрацииВебКабинета" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Last Name";
		НоваяСтрока.RU = "Фамилия";
		НоваяСтрока.UA = "Прізвище";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "First Name";
		НоваяСтрока.RU = "Имя";
		НоваяСтрока.UA = "Ім’я";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Patronymic";
		НоваяСтрока.RU = "Отчество";
		НоваяСтрока.UA = "По батькові";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Email";
		НоваяСтрока.RU = "Электронная почта";
		НоваяСтрока.UA = "Електронна пошта";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Password";
		НоваяСтрока.RU = "Пароль";
		НоваяСтрока.UA = "Пароль";
	
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Confirm Password";
		НоваяСтрока.RU = "Повторите пароль";
		НоваяСтрока.UA = "Повторіть пароль";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Mobile phone";
		НоваяСтрока.RU = "Мобильный телефон";
		НоваяСтрока.UA = "Мобільний телефон";

		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "PFR number";
		НоваяСтрока.RU = "СНИЛС";
		НоваяСтрока.UA = "СНИЛС";

		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Birthday";
		НоваяСтрока.RU = "Дата рождения";
		НоваяСтрока.UA = "Дата народження";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Sex";
		НоваяСтрока.RU = "Пол";
		НоваяСтрока.UA = "Стать";
		
	КонецЕсли;	
	
	Если Тип = "ГруппировкиОбучений" Тогда
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Default";
		НоваяСтрока.RU = "Без группировки";
		НоваяСтрока.UA = "Без угруповання";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Type";
		НоваяСтрока.RU = "Вид обучения";
		НоваяСтрока.UA = "Вид навчання";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Module";
		НоваяСтрока.RU = "Программа обучения";
		НоваяСтрока.UA = "Програма навчання";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Subject";
		НоваяСтрока.RU = "Дисциплина";
		НоваяСтрока.UA = "Дисципліна";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Week";
		НоваяСтрока.RU = "Неделя";
		НоваяСтрока.UA = "Тиждень";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Month";
		НоваяСтрока.RU = "Месяц";
		НоваяСтрока.UA = "Місяць";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Year";
		НоваяСтрока.RU = "Год";
		НоваяСтрока.UA = "Рік";
		
		НоваяСтрока = Словарь.Добавить();
		НоваяСтрока.EN = "Status";
		НоваяСтрока.RU = "Статус";
		НоваяСтрока.UA = "Статус";		
		
	КонецЕсли;
	
	//////////////////////////////////////////////
	// Ищем термин
	
	СтрокаПеревода = Словарь.Найти(Слово, ЯзыкСлова);
	
	Если СтрокаПеревода = Неопределено Тогда
		Возврат Слово;
	Иначе
		Возврат СтрокаПеревода[ЯзыкПеревода];
	КонецЕсли;
	
КонецФункции

Функция РегламентноеЗаданиеОбновленияДанных() Экспорт	
	Возврат ОбщегоНазначенияСУПовтИсп.ИдентификаторРегламентногоЗадания("ОбновлениеДанныхВебКабинетаСУ");	
КонецФункции

Процедура УстановитьОсновнуюПубликацию(ОсновнаяПубликация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерРедакции = Редакция();
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяПубликация, "Редакция")
			<> Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
			ВызватьИсключение НСтр("ru = 'Редакция публикации не соответствует установленной в основных настройках'");
		КонецЕсли;
		Константы.ОсновнаяПубликацияВебКабинета20СУ.Установить(ОсновнаяПубликация);
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяПубликация, "Редакция")
			<> Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
			ВызватьИсключение НСтр("ru = 'Редакция публикации не соответствует установленной в основных настройках'");
		КонецЕсли;
		Константы.ОсновнаяПубликацияВебКабинета30СУ.Установить(ОсновнаяПубликация);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОсновнуюПубликациюИзКонстанты(Знач Редакция = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерРедакции = ?(ЗначениеЗаполнено(Редакция), Редакция, Редакция());
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Возврат Константы.ОсновнаяПубликацияВебКабинета20СУ.Получить();
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		Возврат Константы.ОсновнаяПубликацияВебКабинета30СУ.Получить();
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Неизвестная редакция веб-кабинета'");
	
КонецФункции

Функция ИмяФайлаДистрибутива() Экспорт
	
	НомерРедакции = Редакция();
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Возврат "data.zip";
	КонецЕсли;
	
	Если НомерРедакции = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		Возврат "cabinet.zip";
	КонецЕсли;

	ВызватьИсключение НСтр("ru = 'Неизвестная редакция веб-кабинета'");
	
КонецФункции

//////////////////////////////////////////////////////
// Подписки на события

// Пользователи

// Обновляет данные о пользователе веб-кабинета
//
Процедура ПользователиВебКабинетаСинхронизация(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.Недействителен ИЛИ Источник.ПометкаУдаления Тогда
		
		РегистрыСведений.ПользователиВебКабинетаСУ.УдалитьПользователя(,Источник.Ссылка);
		
	Иначе
		
		Если Источник.ДополнительныеСвойства.Свойство("АутентификацияВебКабинета") Тогда	
			
			Если Источник.ДополнительныеСвойства.АутентификацияВебКабинета Тогда
				
				// Обновляем пользователя веб-кабинета
				
				РегистрыСведений.ПользователиВебКабинетаСУ.ЗаписатьПользователя(Источник.Ссылка, Источник.ИдентификаторПользователяИБ, Отказ);
				
				// Записываем задание на обновление каталога электронных ресурсов
				
				Параметры = Новый Массив;
				Параметры.Добавить(Источник.Ссылка);
				Параметры.Добавить(Неопределено);			
				
				ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.СводыЗнанийСУЗ", "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(Источник.Ссылка.УникальныйИдентификатор()), 0);
								
			Иначе
				
				РегистрыСведений.ПользователиВебКабинетаСУ.УдалитьПользователя(,Источник.Ссылка);
				
			КонецЕсли;						
			
						
		КонецЕсли;		
		
				
	КонецЕсли;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
			
	// Обновляем описание пользователя
	
	Параметры = Новый Массив;
	Параметры.Добавить(Источник.Ссылка);
	Параметры.Добавить(Неопределено);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", Параметры, Строка(Источник.Ссылка.УникальныйИдентификатор()), 0);
	
	// Обновляем каталог пользователей
		
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета", Неопределено, Строка(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")), 0);
	
	//----------------------------------//
	
КонецПроцедуры

// Обновляет данные веб-кабинета при записи групп и профилей групп доступа
//
Процедура ПользователиВебКабинетаОбновлениеДоступа(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	// Получаем группы доступа, пользователей которых надо обновить
	
	МассивГруппДоступа = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПрофилиГруппДоступа") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГруппыДоступа.Ссылка
			|ИЗ
			|	Справочник.ГруппыДоступа КАК ГруппыДоступа
			|ГДЕ
			|	ГруппыДоступа.Профиль = &Профиль
			|	И ГруппыДоступа.ЭтоГруппа = ЛОЖЬ
			|	И ГруппыДоступа.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Профиль", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивГруппДоступа.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ГруппыДоступа") Тогда
		МассивГруппДоступа.Добавить(Источник.Ссылка);
	КонецЕсли;
	
	// Получаем пользователей, чьи списки электронных ресурсов надо обновить
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПользователиВебКабинетаСУ.Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ
		|		ПО ГруппыДоступаПользователи.Пользователь = ПользователиВебКабинетаСУ.Пользователь
		|ГДЕ
		|	ГруппыДоступаПользователи.Ссылка В(&МассивГруппДоступа)";
	
	Запрос.УстановитьПараметр("МассивГруппДоступа", МассивГруппДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивПользователей = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
				
	// Получаем выборку каталога электронных ресурсов
	
	ТаблицаЭлектронныхРесурсов = Справочники.СводыЗнанийСУЗ.ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
	
	// Обновляем каталог электронных курсов пользователей
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(МассивПользователей);
	ПараметрыФЗ.Добавить(ТаблицаЭлектронныхРесурсов);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.СводыЗнанийСУЗ.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(Источник.Ссылка.УникальныйИдентификатор()), 0); 
	
	// Обновляем права пользователей веб-кабинета
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(МассивПользователей);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.Пользователи.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьПользователя", ПараметрыФЗ, Строка(Новый УникальныйИдентификатор()), 0);
	
КонецПроцедуры

Процедура ПользователиВебКабинетаОбновлениеКонстант(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаЭлектронныхРесурсов = Справочники.СводыЗнанийСУЗ.ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Параметры = Новый Массив;
	Параметры.Добавить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь"));
	Параметры.Добавить(ТаблицаЭлектронныхРесурсов);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.СводыЗнанийСУЗ", "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, "Справочник.СводыЗнанийСУЗ.ВсеПользователи", 0);

КонецПроцедуры

Процедура ОбновитьПользователя(Знач Пользователь) Экспорт
	
	МассивПользователей = Новый Массив;
	
	Если ТипЗнч(Пользователь) = Тип("Массив")
		ИЛИ ТипЗнч(Пользователь) = Тип("ФиксированныйМассив") Тогда
		МассивПользователей =  Пользователь;
	Иначе
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	// Обновляем права пользователей
	
	Для каждого ПользовательМассива Из МассивПользователей Цикл
		РегистрыСведений.ПользователиВебКабинетаСУ.ОбновитьПользователя(ПользовательМассива);
	КонецЦикла;
	
	// Обновляем права пользователей в открытых сессиях
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Права,
		|	ПользователиВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ
		|ГДЕ
		|	ПользователиВебКабинетаСУ.Пользователь В(&МассивПользователей)";
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	
	ТаблицаПравПользователей = Запрос.Выполнить().Выгрузить();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессииВебКабинетаСУ.Идентификатор,
		|	СессииВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
		|ГДЕ
		|	СессииВебКабинетаСУ.Пользователь В(&МассивПользователей)
		|	И СессииВебКабинетаСУ.Закрыта = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПраваПользователяСтрока = ТаблицаПравПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь, "Пользователь");
		
		Если ПраваПользователяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РегистрыСведений.СессииВебКабинетаСУ.ОбновитьПрава(ВыборкаДетальныеЗаписи.Идентификатор, ПраваПользователяСтрока.Права);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПраваПользователя(Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ")
	);

	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	ПраваПользователя = Новый Структура();
	
	ЕстьПравоПросмотраКаталогаПользователей = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетКаталогПользователейСУО",,Пользователь);
	ЕстьПравоПросмотраСвоихУчебныхГрупп = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчебныеГруппыСУО",,Пользователь);
	ЕстьПравоПросмотраЛичныхСообщений = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетСообщенияСУО",,Пользователь);
	
	ПраваПользователя.Вставить("Обучение", УправлениеДоступом.ЕстьРоль("ЛичныйКабинетПрохождениеОбученияСУО",,Пользователь));
	ПраваПользователя.Вставить("Библиотека", УправлениеДоступом.ЕстьРоль("ЛичныйКабинетБиблиотекаСУО",,Пользователь));
	ПраваПользователя.Вставить("Сообщения", ЕстьПравоПросмотраЛичныхСообщений);
	ПраваПользователя.Вставить("Форум", УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУчастиеВФорумеСУО",,Пользователь));
	ПраваПользователя.Вставить("Новости", УправлениеДоступом.ЕстьРоль("ЛичныйКабинетИнформационнаяЛентаСУО",,Пользователь));
	ПраваПользователя.Вставить("ДобавлениеНовостей", ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.НовостьСУО, ПользовательИБ));
	ПраваПользователя.Вставить("ЭлектронныеРесурсы", УправлениеДоступом.ЕстьРоль("ЭлектронныеРесурсыПросмотрКаталогаСУО",,Пользователь));
	
	ПраваПользователя.Вставить("СвоиУчебныеГруппы", ЕстьПравоПросмотраСвоихУчебныхГрупп);
	ПраваПользователя.Вставить("КаталогПользователей", ЕстьПравоПросмотраКаталогаПользователей);
	ПраваПользователя.Вставить("Пользователи", ЕстьПравоПросмотраКаталогаПользователей ИЛИ ЕстьПравоПросмотраСвоихУчебныхГрупп ИЛИ ЕстьПравоПросмотраЛичныхСообщений);
	ПраваПользователя.Вставить("Преподавание", УправлениеОбучениемСУО.ЕстьРольПреподавателя(Пользователь));
	
	//----------------------------------//
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	// ПраваПользователя = Новый Структура("ЭлектронныеРесурсы", Истина);
	
	//----------------------------------//
	
	Возврат ПраваПользователя;	
	
КонецФункции

// Зависимости
//

// Обновляет данные веб-кабинета при записи элемента-зависимости
//
Процедура ДанныеВебКабинетаОбновлениеЗависимостейСУПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("НеОбновлятьДанныеВебКабинета")
		И Источник.ДополнительныеСвойства.НеОбновлятьДанныеВебКабинета Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("ОбновитьДанныеВебКабинетаВТранзакции")
		И Источник.ДополнительныеСвойства.ОбновитьДанныеВебКабинетаВТранзакции Тогда
		
		ВыполнитьОбновлениеЗависимостей(Источник.Ссылка, Источник.ДополнительныеСвойства.ОбновитьДанныеВебКабинетаВТранзакции);
		
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		
		ВыполнитьОбновлениеЗависимостей(Источник.Ссылка, Ложь);
		
	Иначе
		
		МассивПараметровФЗ = Новый Массив;
		МассивПараметровФЗ.Добавить(Источник.Ссылка);
		МассивПараметровФЗ.Добавить(Ложь);
		
		ФоновыеЗадания.Выполнить("ВебКабинетСУ.ВыполнитьОбновлениеЗависимостей", МассивПараметровФЗ, Строка(Новый УникальныйИдентификатор()), НСтр("ru = 'Обновление зависимостей данных веб-кабинета'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОбновлениеЗависимостей(СсылкаНаОбъект, ОбновитьДанныеВебКабинетаВТранзакции=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗависимостиДанныхВебКабинетаСУ.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ЗависимостиДанныхВебКабинетаСУ.ОбъектМетаданных КАК ОбъектМетаданныхСтрока
		|ИЗ
		|	РегистрСведений.ЗависимостиДанныхВебКабинетаСУ КАК ЗависимостиДанныхВебКабинетаСУ
		|ГДЕ
		|	ЗависимостиДанныхВебКабинетаСУ.Зависимость = &Зависимость";
	
	Запрос.УстановитьПараметр("Зависимость", СсылкаНаОбъект);
	
	ТаблицаЗависимостей = Запрос.Выполнить().Выгрузить();	
	
	Если ОбновитьДанныеВебКабинетаВТранзакции Тогда		
		
		ОбновитьЗависимости(ТаблицаЗависимостей);
		
	Иначе
		
		Для каждого Строка Из ТаблицаЗависимостей Цикл	
			
			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(Строка.СсылкаНаОбъект);
			ПараметрыФЗ.Добавить(Неопределено);			
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(Строка.ОбъектМетаданныхСтрока, "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(Новый УникальныйИдентификатор()), 0);
			
		КонецЦикла;
		
	КонецЕсли;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Пользователи") Тогда
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета", Неопределено, Строка(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")), 0);
	КонецЕсли;	
	
	//----------------------------------//
	
КонецПроцедуры

// Тома

Процедура КонтрольКоличестваТомовПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТомаХраненияФайлов.Ссылка
			|ИЗ
			|	Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов
			|ГДЕ
			|	ТомаХраненияФайлов.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение НСтр("ru = 'Использование нескольких томов не поддерживается'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Регламентное задание

Функция ВыполнитьВсеЗадания() Экспорт
	
	Возврат ОбщегоНазначенияСУ.ВыполнитьРегламентноеЗаданиеВручную("ОбновлениеДанныхВебКабинетаСУ");
	
КонецФункции

Процедура ОбновлениеДанныхВебКабинетаСУ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();	
	
	// Выполняем задания 
	
	КоличествоНеудачныхЗаданий = 0;
	КоличествоВыполненныхЗаданий = 0;
	
	Задание = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.ПолучитьПервоеЗадание();
	
	Пока Задание <> Неопределено Цикл
		
		Если КоличествоНеудачныхЗаданий > 100 Тогда
			Прервать;
		КонецЕсли;		
		
		Если КоличествоВыполненныхЗаданий > 10000 Тогда
			Прервать; // В следующий раз
		КонецЕсли;		
		
		РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.УдалитьЗадание(Задание.ОбъектМетаданных, Задание.ИмяПроцедуры, Задание.Ключ, Задание.Период);
		
		НачатьТранзакцию();
		
		Попытка
			
			Параметры = Задание.Параметры.Получить();
			
			Если Задание.ИмяПроцедуры = "ВебКабинетСУ.ОбновитьДанныеОбъекта" Тогда
				НомерПовтора = Задание.НомерПовтора; 
				ОбновитьДанныеОбъекта(Задание.ОбъектМетаданных, Параметры[0], Параметры[1], НомерПовтора);
			КонецЕсли;
			
			Если Задание.ИмяПроцедуры = "ВебКабинетСУ.ОбновитьДанныеЗаписи" Тогда
				ОбновитьДанныеЗаписи(Параметры[0], Задание.ОбъектМетаданных);
			КонецЕсли;
			
			Если Задание.ИмяПроцедуры = "ВебКабинетСУ.ОбновитьПользователя" Тогда
				ОбновитьПользователя(Параметры[0]);
			КонецЕсли;			
			
			//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
			
			Если Задание.ИмяПроцедуры = "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета" Тогда
				ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета(Параметры[0]);
			КонецЕсли;			
			
			Если Задание.ИмяПроцедуры = "ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета" Тогда
				ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета();
			КонецЕсли;			
			
			//----------------------------------//			
						
		Исключение
			
			// Транзакцию не отменяем, чтобы дать возможность записаться заданию для повтора	

			КоличествоНеудачныхЗаданий = КоличествоНеудачныхЗаданий + 1;
			
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Задание.ОбъектМетаданных,
				НСТр("ru = 'Выполнение задания по обновлению данных веб-кабинета завершилось с ошибкой: '") + Задание.ИмяПроцедуры + Символы.ПС + ОбщегоНазначенияСУ.ДанныеВJSON(Параметры) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
		КонецПопытки;
		
		ЗафиксироватьТранзакцию();
		
		КоличествоВыполненныхЗаданий = КоличествоВыполненныхЗаданий + 1;
		
		Задание = РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.ПолучитьПервоеЗадание();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗаданиеНаОбновлениеДанных(ОбъектМетаданных, ИмяПроцедуры, Параметры, Ключ, Важность = 0, Знач НомерПовтора = 0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	РегистрыСведений.ЗаданияНаОбновлениеДанныхВебКабинетаСУ.ДобавитьЗадание(ОбъектМетаданных, ИмяПроцедуры, Параметры, Ключ, Важность, НомерПовтора);
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Обновление данных кабинета

Процедура ОбновитьДанныеОбъекта(Знач МенеджерОбъекта, Знач СсылкаНаОбъект, ДополнительныеДанные = Неопределено, Знач НомерПовтора = 0) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МенеджерОбъекта) = Тип("Строка") Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МенеджерОбъекта);
	КонецЕсли;	
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("Массив") ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ФиксированныйМассив") Тогда
		
		МассивЭлементов = СсылкаНаОбъект;
		
		Для каждого Элемент Из МассивЭлементов Цикл
			
			ПовторитьЗадание = Ложь;
			
			Попытка			
				МенеджерОбъекта.ОбновитьДанныеВебКабинета(Элемент, ДополнительныеДанные);
			Исключение
				ПовторитьЗадание = Истина;
				ЗаписьЖурналаРегистрации(
					НСТр("ru = 'Веб-кабинет.Обновление данных'"),
					УровеньЖурналаРегистрации.Ошибка,
					,
					Элемент,
					НСТр("ru = 'Выполнение задания по обновлению данных веб-кабинета завершилось с ошибкой. Попытка будет повторена. ОбновитьДанныеОбъекта '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;
			
			Если ПовторитьЗадание И НомерПовтора < 10 Тогда
				НомерПовтора = НомерПовтора + 1;
				Параметры = Новый Массив;
				Параметры.Добавить(Элемент);
				Параметры.Добавить(ДополнительныеДанные);	
				ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(МенеджерОбъекта.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(Новый УникальныйИдентификатор()), 0, НомерПовтора);
			КонецЕсли;				
				
		КонецЦикла;
		
	Иначе
		
		ПовторитьЗадание = Ложь;
		
		Попытка			
			МенеджерОбъекта.ОбновитьДанныеВебКабинета(СсылкаНаОбъект, ДополнительныеДанные);
		Исключение
			ПовторитьЗадание = Истина;
			ЗаписьЖурналаРегистрации(
				НСТр("ru = 'Веб-кабинет.Обновление данных'"),
				УровеньЖурналаРегистрации.Ошибка,
				,
				СсылкаНаОбъект,
				НСТр("ru = 'Выполнение задания по обновлению данных веб-кабинета завершилось с ошибкой. Попытка будет повторена. ОбновитьДанныеОбъекта '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
		КонецПопытки;
		
		Если ПовторитьЗадание И НомерПовтора < 10 Тогда
			НомерПовтора = НомерПовтора + 1;
			Параметры = Новый Массив;
			Параметры.Добавить(СсылкаНаОбъект);
			Параметры.Добавить(ДополнительныеДанные);
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(МенеджерОбъекта.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(Новый УникальныйИдентификатор()), 0, НомерПовтора);
		КонецЕсли;			
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеЗаписи(Отбор, ИмяРегистра) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	РегистрыСведений[ИмяРегистра].ОбновитьДанныеВебКабинета(Отбор);
	
КонецПроцедуры

Процедура ОбновитьЗависимости(ТаблицаЗависимостей) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;		

	ТаблицаЗависимостейКопия = ТаблицаЗависимостей.Скопировать();
	ТаблицаЗависимостейКопия.Свернуть("ОбъектМетаданныхСтрока");
	
	МассивМетаданных = ТаблицаЗависимостейКопия.ВыгрузитьКолонку("ОбъектМетаданныхСтрока");
	
	Для каждого ОбъектМетаданныхСтрока Из МассивМетаданных Цикл
	
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданныхСтрока);
		
		СтрокиТекущегоМенеджера = ТаблицаЗависимостей.НайтиСтроки(Новый Структура("ОбъектМетаданныхСтрока", ОбъектМетаданныхСтрока));
		
		МассивОбъектов = Новый Массив;
		
		Для каждого Строка Из СтрокиТекущегоМенеджера Цикл
			МассивОбъектов.Добавить(Строка.СсылкаНаОбъект);	
		КонецЦикла;
		
		ОбновитьДанныеОбъекта(МенеджерОбъекта, МассивОбъектов);
	
	КонецЦикла;			
		
КонецПроцедуры

//////////////////////////////////////////////////////
// Установка

Функция ПроверитьВозможностьУстановки() Экспорт
	
	ТекстСообщения = Неопределено;
	
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	АвтоматическаяНастройка = ИспользуетсяАвтоматическаяНастройка();
	АдресИнформационнойБазы = ОбщегоНазначенияСУ.АдресИнформационнойБазы();	
	
	Если АвтоматическаяНастройка Тогда
		
		Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
			ТекстСообщения = НСтр("ru = ''Настройте общий каталог'");						
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресИнформационнойБазы) Тогда
			ТекстСообщения = НСтр("ru = 'Укажите адрес публикации на веб-сервере этой информационной базы'");					
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) И НЕ ЗначениеЗаполнено(АдресИнформационнойБазы) Тогда
			ТекстСообщения = НСтр("ru = 'Настройте общий каталог и указажите адрес публикации на веб-сервере этой информационной базы'");						
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
			ТекстСообщения = НСтр("ru = 'Настройте общий каталог'");			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ИспользуетсяАвтоматическаяНастройка() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ Справочники.ПубликацииВебКабинетаСУ.ЕстьПубликацииРедакции() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге()) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИнициализироватьКаталогВебКабинета(ДляТестирования = Ложь, ОчищатьПередВыгрузкой = Истина, Знач Тема = Неопределено, Знач АдресХраненияДистрибутива) Экспорт
	
	РезультатИнициализации = Новый Структура("КаталогИнициализирован, ТекстОшибки", Истина, "");
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		РезультатИнициализации.ТекстОшибки = 
			НСтр("ru = 'Веб-кабинет сейчас не используется. Установите флажок ""Использовать веб-кабинет"" в общих настройках информационной базы'");
		РезультатИнициализации.КаталогИнициализирован = Ложь;		
		Возврат РезультатИнициализации;
	КонецЕсли;	
	
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	
	Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		РезультатИнициализации.ТекстОшибки = ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог();
		РезультатИнициализации.КаталогИнициализирован = Ложь;		
		Возврат РезультатИнициализации;
	КонецЕсли;	
	
	ПутьККаталогуКабинета = ПутьККаталогуУстановки(ПутьКОбщемуКаталогу);
	ПутьККаталогуФайлов = ПутьККаталогуКартинок(ПутьКОбщемуКаталогу);
	
	ПутьККаталогуКабинетаИФайловСовпадают = ?(ПутьККаталогуКабинета = ПутьККаталогуФайлов, Истина, Ложь);
	
	// Проверяем, существует ли каталог кабинета и при необходимости очищаем
	
	КаталогОбъект = Новый Файл(ПутьККаталогуКабинета);
	
	Если КаталогОбъект.Существует() И КаталогОбъект.ЭтоКаталог() Тогда
		
		// Проверяем каталог инициализации
		
		РезультатПроверкиКаталога = ОбщегоНазначенияСУКлиентСервер.ПроверитьДоступностьКаталогаДляЗаписи(ПутьККаталогуКабинета);
		
		Если НЕ РезультатПроверкиКаталога.ДоступенДляЗаписи Тогда			
			РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Каталог %1 не доступен для записи. Возможная причина ошибки: %2'");
			РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				РезультатИнициализации.ТекстОшибки, ПутьККаталогуКабинета, РезультатПроверкиКаталога.ОписаниеОшибки);
			РезультатИнициализации.КаталогИнициализирован = Ложь;			
			Возврат РезультатИнициализации;			
		КонецЕсли;				
		
		Если ОчищатьПередВыгрузкой Тогда
			
			РезультатПроверкиКаталога = ОбщегоНазначенияСУКлиентСервер.ПроверитьДоступностьКаталогаДляЗаписи(ПутьККаталогуКабинета);
			
			Если РезультатПроверкиКаталога.ДоступенДляЗаписи Тогда
				
				Попытка
					УдалитьФайлы(ПутьККаталогуКабинета);					
				Исключение					
					РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Невозможно удалить каталог %1'");
					РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатИнициализации.ТекстОшибки, ПутьККаталогуКабинета);
					РезультатИнициализации.КаталогИнициализирован = Ложь;					
					Возврат РезультатИнициализации;					
				КонецПопытки;
				
			Иначе
				
				РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Каталог %1 недоступен для записи. Возможная причина ошибки: %2'");
				РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатИнициализации.ТекстОшибки, ПутьККаталогуКабинета, РезультатПроверкиКаталога.ОписаниеОшибки);
				РезультатИнициализации.КаталогИнициализирован = Ложь;
				Возврат РезультатИнициализации;
				
			КонецЕсли;	
			
		КонецЕсли;		
		
	Иначе
		
		// Создаем каталог
		
		Попытка			
			СоздатьКаталог(ПутьККаталогуКабинета); // Если каталог существует, то ничего не происходит			
		Исключение			
			РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Невозможно создать каталог %1'");
			РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатИнициализации.ТекстОшибки, ПутьККаталогуКабинета);
			РезультатИнициализации.КаталогИнициализирован = Ложь;			
			Возврат РезультатИнициализации;			
		КонецПопытки;		
		
	КонецЕсли;
	
	// Если каталог файлов не совпадает с каталогом кабинета,
	// то выполняем все аналогичные действия для него.
		
	Если НЕ ПутьККаталогуКабинетаИФайловСовпадают Тогда
		
		КаталогФайловОбъект = Новый Файл(ПутьККаталогуФайлов);
		
		Если КаталогФайловОбъект.Существует() И КаталогФайловОбъект.ЭтоКаталог() Тогда
			
			// Проверяем каталог инициализации
			
			РезультатПроверкиКаталога = ОбщегоНазначенияСУКлиентСервер.ПроверитьДоступностьКаталогаДляЗаписи(ПутьККаталогуФайлов);
			
			Если НЕ РезультатПроверкиКаталога.ДоступенДляЗаписи Тогда			
				РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Каталог %1 не доступен для записи. Возможная причина ошибки: %2'");
				РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					РезультатИнициализации.ТекстОшибки, ПутьККаталогуФайлов, РезультатПроверкиКаталога.ОписаниеОшибки);
				РезультатИнициализации.КаталогИнициализирован = Ложь;			
				Возврат РезультатИнициализации;			
			КонецЕсли;		
			
			ПутьКФайлуДатаВыгрузкиКабинетаРедакции2 = ПутьККаталогуФайлов + "date.info";
			ФайлДатаВыгрузкиКабинетаРедакции2 = Новый Файл(ПутьКФайлуДатаВыгрузкиКабинетаРедакции2);
			
			// Если в каталоге с файлами установлен кабинет редакции 2.0, то файлы не удаляем из него
			
			Если ОчищатьПередВыгрузкой И НЕ ФайлДатаВыгрузкиКабинетаРедакции2.Существует() Тогда
				
				РезультатПроверкиКаталога = ОбщегоНазначенияСУКлиентСервер.ПроверитьДоступностьКаталогаДляЗаписи(ПутьККаталогуФайлов);
				
				Если РезультатПроверкиКаталога.ДоступенДляЗаписи Тогда
					
					Попытка
						УдалитьФайлы(ПутьККаталогуФайлов);					
					Исключение					
						РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Невозможно удалить каталог %1'");
						РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							РезультатИнициализации.ТекстОшибки, ПутьККаталогуФайлов);
						РезультатИнициализации.КаталогИнициализирован = Ложь;					
						Возврат РезультатИнициализации;					
					КонецПопытки;
					
				Иначе
					
					РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Каталог %1 недоступен для записи. Возможная причина ошибки: %2'");
					РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						РезультатИнициализации.ТекстОшибки, ПутьККаталогуФайлов, РезультатПроверкиКаталога.ОписаниеОшибки);
					РезультатИнициализации.КаталогИнициализирован = Ложь;
					Возврат РезультатИнициализации;
					
				КонецЕсли;	
				
			КонецЕсли;		
		
		Иначе
			
			// Создаем каталог файлов
			
			Попытка			
				СоздатьКаталог(ПутьККаталогуФайлов); // Если каталог существует, то ничего не происходит			
			Исключение			
				РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Невозможно создать каталог %1'");
				РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатИнициализации.ТекстОшибки, ПутьККаталогуФайлов);
				РезультатИнициализации.КаталогИнициализирован = Ложь;			
				Возврат РезультатИнициализации;			
			КонецПопытки;		
			
		КонецЕсли;
			
		
	КонецЕсли;
	
	// Выгружаем файлы портала
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла("");
	ВременныйКаталог = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталог);
	
	СоздатьКаталог(ВременныйКаталог);
	
	КабинетДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХраненияДистрибутива);
	КабинетПутьКАрхиву    = ВременныйКаталог + "data.zip";
	
	КабинетДвоичныеДанные.Записать(КабинетПутьКАрхиву);
	
	Редакция = ВебКабинетСУ.Редакция();
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
	
		Архиватор = Новый ЧтениеZipФайла(КабинетПутьКАрхиву);
		Архиватор.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		
		Если НЕ ЗначениеЗаполнено(Тема) Тогда
			Тема = Перечисления.ТемыВебКабинетаСУ.Облако;
		КонецЕсли;
		
		ИмяАрхиваМодификации = ВебКабинетСУ.Модификация() + "_" + ?(ДляТестирования, "src", "dist") + "_" + Перечисления.ТемыВебКабинетаСУ.КодТемы(Тема) + ".zip";
		
		Архиватор = Новый ЧтениеZipФайла(ВременныйКаталог + ИмяАрхиваМодификации);
		Архиватор.ИзвлечьВсе(ПутьККаталогуКабинета, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		
		Архиватор = Новый ЧтениеZipФайла(КабинетПутьКАрхиву);
		Архиватор.ИзвлечьВсе(ПутьККаталогуКабинета, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ВременныйКаталог);		
	Исключение
	КонецПопытки;
	
	// Размещаем файл res.js
	//
	
	ПутьККаталогуЭлектронныхРесурсов = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуЭлектронныхРесурсов(ПутьКОбщемуКаталогу);
	
	КаталогЭлектронныхРесурсов = Новый Файл(ПутьККаталогуЭлектронныхРесурсов);
	
	Если НЕ КаталогЭлектронныхРесурсов.Существует() ИЛИ НЕ КаталогЭлектронныхРесурсов.ЭтоКаталог() Тогда
		СоздатьКаталог(ПутьККаталогуЭлектронныхРесурсов);
	КонецЕсли;
	
	Обработки.ПубликацияЭлектронныхРесурсовСУЗ.РазместитьФайлResJS(ПутьККаталогуЭлектронныхРесурсов);	
	
	// Запоминаем дату выгрузки
	
	ПутьКФайлуДатаВыгрузки = ПутьККаталогуКабинета + "date.info";
	ТекстовыйДокументДатаВыгрузки = Новый ТекстовыйДокумент;
	ТекстовыйДокументДатаВыгрузки.УстановитьТекст(XMLстрока(ТекущаяДатаСеанса()));
	ТекстовыйДокументДатаВыгрузки.Записать(ПутьКФайлуДатаВыгрузки);	
	
	// Завершаем
	
	Возврат РезультатИнициализации;
	
КонецФункции

Функция ЗаполнитьДанныеВебКабинета(ОчищатьПередВыгрузкой = Истина, ФоновымЗаданием = Истина) Экспорт
	
	////////////////////////////////////////////////////
	// Делаем проверки
	//
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваПоследнегоФоновогоЗадания = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(
		ВебКабинетСУ.РегламентноеЗаданиеОбновленияДанных()
	);
	
	Если СвойстваПоследнегоФоновогоЗадания <> Неопределено
	   И СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
	   
	   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Установка не может быть запущена, так как выполняется обновление данных веб-кабинета.
                                                              |Дождитесь завершения работы регламентного задания ""Обновление данных веб-кабинета"".
                                                              |'"));
	   
	   Возврат Ложь;
	   
	КонецЕсли;
	   
	НачатьТранзакцию();
	
	////////////////////////////////////////////////////
	// Обновляем пользователей веб-кабинета
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВсеПользователиВебКабинета = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	// Обновляем права
	
	ВебКабинетСУ.ОбновитьПользователя(ВсеПользователиВебКабинета);
	
	// Закрываем сессии
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессииВебКабинетаСУ.Идентификатор
		|ИЗ
		|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
		|ГДЕ
		|	СессииВебКабинетаСУ.Закрыта = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.СессииВебКабинетаСУ.ЗакрытьСессию(ВыборкаДетальныеЗаписи.Идентификатор);
	КонецЦикла;
	
	////////////////////////////////////////////////////
	// Создаем задания на обновление данные
	
	// Удаляем все данные
	
	Если ОчищатьПередВыгрузкой Тогда
	
		МассивРегистровДляОчистки = Новый Массив;
		
		МассивРегистровДляОчистки.Добавить("ЗависимостиДанныхВебКабинетаСУ");
		МассивРегистровДляОчистки.Добавить("ДанныеВебКабинетаСУЗ_ПН");
		МассивРегистровДляОчистки.Добавить("ЗаданияНаОбновлениеДанныхВебКабинетаСУ");
		
		//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
		
		МассивРегистровДляОчистки.Добавить("ДанныеВебКабинетаСУО_ОН");
		МассивРегистровДляОчистки.Добавить("ДанныеВебКабинетаСУО_ОП");
		МассивРегистровДляОчистки.Добавить("ДанныеВебКабинетаСУО_ПН");
		МассивРегистровДляОчистки.Добавить("ДанныеВебКабинетаСУО_ПП");
		МассивРегистровДляОчистки.Добавить("ОтборыДанныхВебКабинетаСУО_О");
		МассивРегистровДляОчистки.Добавить("ОтборыДанныхВебКабинетаСУО_П");
		
		//----------------------------------//	
		
		Для каждого ИмяРегистра Из МассивРегистровДляОчистки Цикл
		
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Записать();
		
		КонецЦикла;
		
	КонецЕсли;
		
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Документы
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить("НовостьСУО");
	МассивДокументов.Добавить("ПроведениеОбученияСУО");
	МассивДокументов.Добавить("ПрохождениеОбученияСУО");
	МассивДокументов.Добавить("СообщениеСУО");	
	МассивДокументов.Добавить("НаполнениеБиблиотекиПользователейСУО");
	МассивДокументов.Добавить("ПопыткаВыполненияЗаданияСУО");
	МассивДокументов.Добавить("ПроведениеПреподавателемОбученияСУО");
	МассивДокументов.Добавить("ЗаявкаНаОбучениеСУО");
	
	Для каждого ИмяДокумента Из МассивДокументов Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Документ.Ссылка
			|ИЗ
			|	Документ."+ИмяДокумента+" КАК Документ
			|ГДЕ
			|	Документ.Проведен = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Параметры = Новый Массив;
			Параметры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			Параметры.Добавить(Неопределено);
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Документ."+ИмяДокумента, "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));

		КонецЦикла;	
	
	КонецЦикла;	
	
	// Справочники
	
	МассивСправочников = Новый Массив;
	МассивСправочников.Добавить("ОрганизаторыСУО");
	МассивСправочников.Добавить("РазделыФорумаСУО");
	МассивСправочников.Добавить("СтруктураБиблиотекиПользователейСУО");
	МассивСправочников.Добавить("ТемыСообщенийСУО");
	МассивСправочников.Добавить("ЛитератураСУО");
	МассивСправочников.Добавить("УчебныеГруппыОО");
	МассивСправочников.Добавить("УчебныеГруппыСУО");
	МассивСправочников.Добавить("ВидыМероприятийСУО");
	
	Для каждого ИмяСправочника Из МассивСправочников Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Справочник.Ссылка
			|ИЗ
			|	Справочник."+ИмяСправочника+" КАК Справочник
			|ГДЕ
			|	Справочник.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Параметры = Новый Массив;
			Параметры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			Параметры.Добавить(Неопределено);
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник."+ИмяСправочника, "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
			
		КонецЦикла;

	КонецЦикла;	
	
	// Независимые регистры
	
	МассивРегистров = Новый Массив; 
	МассивРегистров.Добавить("НастройкиТемФорумаСУО");
	МассивРегистров.Добавить("ФотографииПользователейСУО");
	
	// НастройкиЛичныхСообщенийСУО - не требуется, так как данные
	// этого регистра обновляются при обновлении сообщений
	
	Для каждого ИмяРегистра Из МассивРегистров Цикл
	
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		
		Параметры = Новый Массив;
		Параметры.Добавить(НаборЗаписей.Отбор);
		
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ИмяРегистра, "ВебКабинетСУ.ОбновитьДанныеЗаписи", Параметры, Новый УникальныйИдентификатор());
		
	КонецЦикла;

	// Библиотека пользователя (обновляется для всех пользователей, имеющих библиотеку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БиблиотекаПользователейСУО.Пользователь
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейСУО КАК БиблиотекаПользователейСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Параметры = Новый Массив;
	Параметры.Добавить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь"));
	Параметры.Добавить(Неопределено);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("РегистрСведений.БиблиотекаПользователейСУО", "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, "БиблиотекаПользователейСУО.ВсеПользователи");
		
	// Каталог пользователей и описание каждого пользователя
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ";
	
	ВсеПользователиБазы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для каждого Пользователь Из ВсеПользователиБазы Цикл
		
		Параметры = Новый Массив;
		Параметры.Добавить(Пользователь);
		Параметры.Добавить(Неопределено);		
		
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", Параметры, Строка(Пользователь.УникальныйИдентификатор()), 0);
	
	КонецЦикла;
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета", Неопределено, Строка(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")), 0);
	
	//----------------------------------//
	
	// Электронные ресурсы (обновляется для всех пользователей)
	
	ТаблицаЭлектронныхРесурсов = Справочники.СводыЗнанийСУЗ.ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
		
	Параметры = Новый Массив;
	Параметры.Добавить(ВсеПользователиВебКабинета);
	Параметры.Добавить(ТаблицаЭлектронныхРесурсов);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.СводыЗнанийСУЗ", "ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, "Справочник.СводыЗнанийСУЗ.ВсеПользователи", 0);
	
	////////////////////////////////////////////////////
	// Завершаем
	
	Если НЕ ФоновымЗаданием Тогда		
		ВебКабинетСУ.ОбновлениеДанныхВебКабинетаСУ();
	КонецЕсли;
	
	// Если ФоновымЗаданием, то запуск будет выполнен по расписанию
	// регламентного задания.
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

// Возвращает свойства последнего фонового задания выполненного при выполнении регламентного задания, если оно есть.
// Процедура работает, как в файл-серверном, так и в клиент-серверном режимах.
// Копия процедуры из модуля РегламентныеЗаданияСлужебный (логика не изменялась)
//
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание, Строка - строка уникального идентификатора РегламентногоЗадания.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено.
//
Функция СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание)
	
	РегламентныеЗаданияСлужебный.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), Строка(РегламентноеЗадание.УникальныйИдентификатор), РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = РегламентныеЗаданияСлужебный.СвойстваФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции
